tap "homebrew/bundle"
tap "koekeishiya/formulae"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reports from gcov test coverage program
brew "gcovr"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Memory training application
cask "anki"
# Desktop password and login vault
cask "bitwarden"
# E-books management software
cask "calibre"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Full TeX Live distribution with GUI applications
cask "mactex"
# VPN client
cask "mullvadvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "james-yu.latex-workshop"
vscode "junstyle.vscode-django-support"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "qiaojie.binary-viewer"
vscode "redhat.vscode-xml"
vscode "tdennis4496.cmantic"
vscode "thebarkman.vscode-djaneiro"
vscode "vscode-icons-team.vscode-icons"
vscode "zignd.html-css-class-completion"
